{
  "title": "Teaching",
  "content": "### **Philosophy & Approach**\n\nIn my tenure as an instructor and teaching assistant in the realm of sociology, I've been driven by a desire to delve deep into both the content and methodological intricacies of the discipline. As I've advanced in my academic journey at Syracuse University, my responsibilities have expanded—encompassing the crafting of syllabi, structuring courses, and crafting a unique educational strategy.\n\nMy teaching philosophy can be encapsulated by three core principles:\n\n1. **Fostering Critical Thinking:** Central to my teaching approach is the cultivation of critical thinking. I actively encourage students to question assumptions, critically evaluate evidence, and engage in in-depth discussions to comprehend complex sociological paradigms. Through these discussions, I aim to guide them to a point where they can effectively dissect intricate sociological phenomena.\n2. **Promoting Empathy & Cultural Competence:** I am committed to creating a classroom atmosphere where diverse perspectives are valued. It is paramount to respect and appreciate the myriad backgrounds students bring to the table. I believe sociology has the potential to bridge divides and create a more inclusive society.\n3. **Imparting Practical Research Skills:** Equally important to my teaching strategy is to arm students with the practical skills vital for conducting thorough sociological research.\n\n### **Courses & Highlights**\n\n**Critical Issues for the United States:** As part of an interdisciplinary team from the Maxwell School of Citizenship and Public Affairs, I have contributed to this signature course. Emphasizing fact-based reasoning and democratic values, our primary engagement tool is dialogue. Through extensive reading, respectful discourse, and thoughtful conclusion sharing, this course embodies the essence of democracy in action.\n\n**Social Problems:** In my iterations of this course, I provide a broad overview of the significant social challenges confronting contemporary American society. The goal is to imbue students with a solid foundation in sociological inquiry. Key objectives include identifying major social issues like poverty and racism and understanding their historical and cultural underpinnings.\n\n**Introduction to Research:** Tailored to provide insights into the logic and nuances of social scientific research, this course emphasizes quantitative research methods. From understanding the philosophy of science to learning data analysis using computer software, this course aims to equip students with comprehensive research skills.\n\n**Introduction to Sociology:** This foundational course offers insights into the fundamental concepts, theories, and findings within sociology. It equips students to understand the multifaceted structures of society. The overarching goals include familiarizing students with basic sociological concepts and helping them recognize how societal forces shape individual experiences.\n\nEach course is meticulously designed to not just impart knowledge but to cultivate critical thinking, analytical prowess, and a deep-rooted understanding of the intricacies of sociological inquiry.\n\n### **Student Impact**\n\nIn my 'Introduction to Sociology' class, I encountered Olivia, a student brimming with passion but who often embraced information without critical examination. When we explored social stratification, diving into theories like the Marxist and Weberian perspectives, Olivia hesitated to venture beyond her initial beliefs. To challenge this mindset, I played devil's advocate during discussions. For example, amidst a class consensus on the systemic nature of income inequality, I presented counterarguments focusing on individual agency, urging students to defend their stances with solid evidence and reasoning.\n\nThis teaching approach profoundly affected Olivia. Through Socratic questioning, I encouraged her—and indeed the entire class—to scrutinize their preconceived notions and meticulously assess the evidence supporting them. Confronted with diverse perspectives, Olivia shifted from merely absorbing information to actively critiquing sociological theories. Her transformation was evident in her final paper, a thoughtful analysis of how social capital shapes inequality. Beyond this academic achievement, Olivia shared that this method of engaging opposing viewpoints had reshaped her approach to information evaluation in everyday life."
}