{
  "publishedAt": "23rd Oct 2023",
  "content": "#### Overview:\n\nThis project scrutinizes the pivotal role of US state policies in influencing life expectancy trends from the 1970s through 2014, shedding light on the substantial impact of these policies on public health outcomes.\n\n#### Role and Responsibilities:\n\nAs a co-author in this research, I actively engaged in data analysis, data cleaning, and data collection processes. My contributions were instrumental in ensuring the accuracy and reliability of the dataset, which formed the backbone of our comprehensive analysis.\n\n#### Methodology:\n\nI played a significant role in merging annual data on life expectancy across US states with data spanning 18 state-level policy domains, ranging from tobacco and environment to tax and labor. My proficiency in data handling was vital in controlling for variances in state characteristics and population demographics, paving the way for an accurate modeling of the association between state policies and life expectancy.\n\n#### Key Findings and Contributions:\n\nOur research unearthed critical insights, demonstrating a clear association between life expectancy trends and changes in state policies along a conservative-liberal continuum. My role in data analysis was pivotal in establishing that:\n\n1. More liberal policies, which expand economic regulations and protect marginalized groups, correlate with increased life expectancy.\n2. The recent stagnation and decline in US life expectancy could be attributed to the implementation of more conservative policies at the state level.\n\nThese findings contribute to a broader understanding of public health trends, emphasizing the need for policy interventions to reverse the deterioration of Americans’ health and longevity.\n\n#### Skills and Tools Used:\n\nMy work in this project honed my skills in data analysis, data cleaning, and data collection, utilizing various computational tools to manage and analyze large datasets effectively. My ability to scrutinize data critically ensured the integrity of our findings.\n\n#### Reflection and Learning:\n\nBeing part of this project was an enriching experience, as it underscored the profound impact of state policies on public health outcomes. My role in data handling and analysis has reinforced my belief in the power of evidence-based research in shaping policies for the betterment of society.\n\n#### Links and Resources:\n\nPublished Paper: <a href=\"https://onlinelibrary.wiley.com/doi/full/10.1111/1468-0009.12469\">https://onlinelibrary.wiley.com/doi/full/10.1111/1468-0009.12469</a>",
  "title": "Assessing the Impact of State Policies on US Life Expectancy Trends",
  "featuredImage": "/images/uploads/800px-red_and_blue_states_map_-average_margins_of_presidential_victory-.svg.png"
}