{
  "publishedAt": "23rd Oct 2023",
  "title": "Online Reviews in Syracuse's Food Scene",
  "content": "In this project, I delved into the world of online customer reviews for various restaurants located in Syracuse, New York. Using computational methods, I conducted a content analysis of reviews across different cuisines to identify prevailing themes, assess the dining experience, and explore cross-cuisine visitation patterns. The research aimed to uncover how perceptions and evaluations in reviews significantly vary across different types of cuisine, revealing underlying biases and preferences in the community.\n\n#### **Role and Responsibilities:**\n\nIn my capacity as the lead researcher, I designed the study, implemented computational methods for data analysis, and critically evaluated the findings.\n\n#### **Methodology:**\n\nThe methodology hinged on employing natural language processing (NLP) and machine learning techniques to analyze a large dataset of online customer reviews for 237 restaurants in Syracuse. The reviews spanned various types of cuisine, providing a rich source of data for examining public opinion and customer experience.\n\n#### **Key Findings and Contributions:**\n\nThe study revealed significant insights into how different cuisines are perceived and evaluated in the Syracuse food scene:\n\n* Mainstream cuisines tend to receive more attention regarding non-food-related attributes such as service and ambiance.\n* Reviews for immigrant cuisines emphasize food-related attributes, particularly authenticity, indicating a different set of expectations and evaluations.\n\nThese findings are instrumental for restaurateurs and stakeholders in the food industry, offering them a nuanced understanding of customer preferences and helping them to align their services with community expectations.\n\n#### **Skills and Tools Used:**\n\nThis project honed my skills in data analysis, computational methods, and critical interpretation. I employed various tools and techniques in natural language processing and machine learning to conduct the content analysis, ensuring a comprehensive and unbiased examination of the online reviews.\n\n#### **Reflection and Learning:**\n\nThe project provided me with valuable insights into the dynamics of dining culture in Syracuse and the role of online reviews in shaping public opinion. It highlighted the importance of considering cultural and social contexts in evaluating customer feedback, emphasizing the need for a critical approach in analyzing online content.",
  "featuredImage": "/images/uploads/mobile-hand-screen-apple-ipad-restaurant-1234397-pxhere.com.jpg"
}